Analyse/cas_utilisation/mobile/global.puml
@startuml global_mobile
title Cas d'Utilisation Global - Application Mobile
left to right direction

skinparam usecase {
  BackgroundColor #FEF9E7
  BorderColor #F1C40F
}


actor "Formateur" as Trainer
actor "Administrateur" as Admin
actor "Étudiant" as Student

rectangle "Application Mobile (AttendanceFlow-AMS)" {
    usecase "S'authentifier" as UC_M01
    usecase "Pointer les absences (Flash)" as UC_M02
    usecase "Saisir motif de retard" as UC_M02a
    usecase "Consulter ses absences (Rapide)" as UC_M06
    usecase "Vérifier statut de session" as UC_M08
}

Trainer -- UC_M01
Trainer -- UC_M02
UC_M02 <.. UC_M02a : <<extend>>

Admin -- UC_M01
Admin -- UC_M02

Student -- UC_M01
Student -- UC_M06
Student -- UC_M08

@enduml
